#include<stdio.h>
int main()
{
	char a = -1;
	//10000001 原码
	//11111110 反码
	//11111111 补码
	//11111111111111111111111111111111 整形提升原码
	//10000000000000000000000000000000 整形提升反码
	//10000000000000000000000000000001 整形提升补码
	signed char b = -1;
	//同上
	unsigned char c = -1;
	//00000000000000000000000011111111 整形提升原码
	//无符号则相同
    char d = -128;
	//10000000
	//11111111
	//10000000
    //11111111111111111111111110000000 整形提升的补码
    //提升后认为它是无符号整形，原反补相同，所以直接输出
	printf("%d %d %d %u", a, b, c, d);
	return 0;
}