#include<stdio.h>
int main()
{
	//说明浮点数和整数在内存中存储方式一定是有区别的
	int n = 9;
    //00000000000000000000000000001001
	float* pFloat = (float*)&n;
	printf("n的值为:%d\n", n); //打印的就是n
	printf("*pFloat的值为:%f\n", *pFloat); //以浮点数视角去看的
	//由n的二进制码得:s=0 M=0.00000000000000000001001 E=00000000 //打印出来的数只有小数点后6位，剩下的数已经看不到了，所以全0
	*pFloat = 9.0; //以浮点数视角，存储9.0
    /* 1001.0 --> 1.001*2^3
    s=0 M=001 E=3+127
    所以存储的二进制为:01000001000100000000000000000000*/
	printf("num的值为:%d\n", n);
	printf("pFloat的值为:%f\n", *pFloat);
	return 0;
}